# Important Series Method

In [1]:
import numpy as np
import pandas as pd

In [2]:
subs = pd.read_csv('subs.csv')

In [3]:
kohli = pd.read_csv('kohli_ipl.csv')

In [4]:
bollywood = pd.read_csv('bollywood.csv')

In [8]:
# astype
import sys
sys.getsizeof(kohli)

3604

In [10]:
sys.getsizeof(kohli.astype('int16'))

1024

In [18]:
# between
kohli[kohli['match_no'].between(1,15)]

    match_no  runs
0          1     1
1          2    23
2          3    13
3          4    12
4          5     1
5          6     9
6          7    34
7          8     0
8          9    21
9         10     3
10        11    10
11        12    38
12        13     3
13        14    11
14        15    50

In [24]:
# clip
subs.clip(lower=100, upper=500).tail()

     Subscribers gained
360                 231
361                 226
362                 155
363                 144
364                 172

In [25]:
# drop_duplicates
temp = pd.Series([1,2,2,3,4,4,5,5,5,6])
temp.drop_duplicates()

0    1
1    2
3    3
4    4
6    5
9    6
dtype: int64

In [31]:
bollywood.drop_duplicates(subset=[bollywood.columns[1]])

                                     movie              lead
0                 Uri: The Surgical Strike     Vicky Kaushal
1                            Battalion 609       Vicky Ahuja
2     The Accidental Prime Minister (film)       Anupam Kher
3                          Why Cheat India     Emraan Hashmi
4                          Evening Shadows  Mona Ambegaonkar
...                                    ...               ...
1476                            Sssshhh...  Tanishaa Mukerji
1480      Rules: Pyaar Ka Superhit Formula            Tanuja
1481           Right Here Right Now (film)             Ankit
1485           Talaash: The Hunt Begins...     Rakhee Gulzar
1487                       The Pink Mirror   Edwin Fernandes

[566 rows x 2 columns]

In [34]:
# duplicated
temp = pd.Series([1,2,2,3,4,4,5,5,5,6])
temp.duplicated()   # show boolean values

0    False
1    False
2     True
3    False
4    False
5     True
6    False
7     True
8     True
9    False
dtype: bool

In [36]:
kohli.duplicated().sum()  # count duplicates

np.int64(0)

In [ ]:
temp = pd.Series([1,2,np.nan,3,np.nan,4,5])
temp.count()  # count non-null values

np.int64(5)

In [42]:
temp.size # total size

7

In [ ]:
# is null
temp.isnull()  # check for null values`

0    1.0
1    2.0
3    3.0
5    4.0
6    5.0
dtype: float64

In [44]:
# dropna
temp.dropna()  # drop null values

0    1.0
1    2.0
3    3.0
5    4.0
6    5.0
dtype: float64

In [ ]:
# fillna
temp.fillna(temp.mean())  # fill null values with mean

0    1.0
1    2.0
2    3.0
3    3.0
4    3.0
5    4.0
6    5.0
dtype: float64

In [48]:
#isin
temp.isin([2,4,6])  # check if values are in the list

0    False
1     True
2    False
3    False
4    False
5     True
6    False
dtype: bool

In [52]:
kohli['runs'].isin([0,100]) # check if runs are 0 or 100

0      False
1      False
2      False
3      False
4      False
       ...
210     True
211    False
212    False
213    False
214    False
Name: runs, Length: 215, dtype: bool

In [65]:
# apply - apply a function to each element & custom functions
bollywood.apply(lambda x: x.str.split().str[0])  # get first word of each title

          movie     lead
0          Uri:    Vicky
1     Battalion    Vicky
2           The   Anupam
3           Why   Emraan
4       Evening     Mona
...         ...      ...
1495        Hum     Shah
1496    Aankhen  Amitabh
1497   Saathiya    Vivek
1498    Company     Ajay
1499      Awara   Akshay

[1500 rows x 2 columns]

In [68]:
subs

     Subscribers gained
0                    48
1                    57
2                    40
3                    43
4                    44
..                  ...
360                 231
361                 226
362                 155
363                 144
364                 172

[365 rows x 1 columns]

In [75]:
subs['Subscribers gained'].apply(lambda x : 'good day' if x > subs['Subscribers gained'].mean()  else "lesser")

0        lesser
1        lesser
2        lesser
3        lesser
4        lesser
         ...
360    good day
361    good day
362    good day
363    good day
364    good day
Name: Subscribers gained, Length: 365, dtype: object

In [76]:
subs['Subscribers gained'].mean()

np.float64(135.64383561643837)

In [82]:
kohli

     match_no  runs
0           1     1
1           2    23
2           3    13
3           4    12
4           5     1
..        ...   ...
210       211     0
211       212    20
212       213    73
213       214    25
214       215     7

[215 rows x 2 columns]

In [ ]:
# copy --> create a copy of series/dataframe

kohli_copy_runs = kohli['runs'].copy()
kohli_copy_runs # we get a copy of runs column

0       1
1      23
2      13
3      12
4       1
       ..
210     0
211    20
212    73
213    25
214     7
Name: runs, Length: 215, dtype: int64